insert into roles(name)
values ('ROLE_ADMIN'),
       ('ROLE_USER'),
       ('ROLE_MANAGER');

insert into users(email, password, url_logo, first_name, last_name, phone, role_id,provider,status)
values ('admin@gmail.com', '$2y$12$iod5PRHZaYrIO6L3onnnk.Mhx9Hc1lb2ehBi0hRvPDD83u6OM/b66',
        '/static/images/user/avatar/user1.png', 'Admin', 'Admin', '+38000000000', 1,'local',true),
       ('user@gmail.com', '$2y$12$aDvzOnearRd4eulVJID3pOufutAIXVU5i1GKhgpXuvyVmktuSAmqe',
        '/static/images/user/avatar/user2.png', 'user', 'user', '+38000000000', 2,'local',true),
       ('user2@gmail.com', '$2y$12$aDvzOnearRd4eulVJID3pOufutAIXVU5i1GKhgpXuvyVmktuSAmqe',
        '/static/images/user/avatar/user3.png', 'user2', 'user2', '+38000000000', 2, 'local',true),
       ('not_active_user@gmail.com', '$2y$12$aDvzOnearRd4eulVJID3pOufutAIXVU5i1GKhgpXuvyVmktuSAmqe',
        '/static/images/user/avatar/user2.png', 'user3', 'user3', '+38000000000', 2,'local',false);

insert into cities(name, latitude, longitude)
values ('Київ', 50.4501, 30.5234),
       ('Харків', 49.9935, 36.2304),
       ('Дніпро', 48.479512881488375, 35.00721554865378),
       ('Одеса', 46.4825, 30.7233),
       ('Запоріжжя', 47.8228900, 35.1903100),
       ('Луганськ', 48.5740, 39.3078),
       ('Донецьк', 48.0159, 37.8028),
       ('Львів', 49.838203883856785, 24.02474257343053),
       ('Рівне', 50.6199, 26.2516);



insert into categories(sortby, name, description, url_logo, background_color, tag_background_color, tag_text_color)
values ('1', 'Спортивні секції', 'Футбол, бокс, хокей, гімнастика, плавання, бойові мистецтва тощо',
        '/static/images/categories/sport.svg', '#1890FF', '#1890FF', '#fff'),
       ('5', 'Танці, хореографія', 'Класичні і народні танці, брейк-данс, степ, контемп, балет та ін.',
        '/static/images/categories/dance.svg', '#531DAB', '#F9F0FF', '#531DAB'),
       ('10', 'Студії раннього розвитку', 'Центри раннього розвитку, заняття для малюків, розвиток мовлення',
        '/static/images/categories/improvement.svg', '#73D13D',
        '#73D13D',
        '#fff'),
       ('15', 'Програмування, робототехніка, STEM',
        'Вивчення природничих наук, технологій, інженерії та математики, STEM-освіта',
        '/static/images/categories/programming.svg', '#597EF7',
        '#597EF7',
        '#fff'),
       ('20', 'Художні студії, мистецтво, дизайн',
        'Образотворче мистецтво, дизайн, комп’ютерна графіка', '/static/images/categories/art.svg', '#9254DE',
        '#9254DE',
        '#fff'),
       ('25', 'Вокальна студія, музика, музичні інструменти',
        'Музична школа, хор, ансамбль, гра на музичних інструментах, звукорежисерський гурток та ін.',
        '/static/images/categories/music.svg',
        '#FF7A45',
        '#FF7A45',
        '#fff'),
       ('30', 'Акторська майстерність, театр', 'Театральна студія, ляльковий театр, акторська майстерність',
        '/static/images/categories/theatre.svg', '#FF4D4F',
        '#FF4D4F',
        '#fff'),
       ('35', 'Особистісний розвиток', 'Розвиток лідерських якостей, підприємництво для підлітків, фінансова грамотність',
        '/static/images/categories/self-improvement.svg', '#FADB14',
        '#FFF9D4',
        '#D46B08'),
       ('40', 'Журналістика, дитяче телебачення, монтаж відео, влогів',
        'Курси журналістики, дитяче телебачення і радіомовлення, монтаж відео, школа блогінгу',
        '/static/images/categories/tv.svg',
        '#13C2C2',
        '#13C2C2', '#fff'),
       ('45', 'Центр розвитку', 'підприємництво для підлітків, фінансова грамотність',
        '/static/images/categories/center.svg', '#F759AB', '#F759AB', '#fff'),
       ('50', 'Інше', 'Тут є цікаві гуртки, які не потрапили в інші категорії', '/static/images/categories/other.svg',
        '#FFA940', '#FFA940', '#fff');

insert into news(title, description, date, url_title_logo)
values ('title1', 'description1', '2021-02-15 16:06:36.21',
        'https://vechirniy.kyiv.ua/data/news/full/58cbc15d9f4cb.jpg'),
       ('title2', 'description2', '2021-02-15 16:06:36.21', 'https://cpo.in.ua/articles/technik/DSC00014.JPG'),
       ('title3', 'description3', '2021-02-15 16:06:36.21',
        'https://fti.dp.ua/dsit/wp-content/uploads/sites/2/2020/02/sci-tech-talks-1-1080x608.jpg');

insert into districts(name, city_id)
values ('Деснянський', 1),
       ('Святошинський', 1),
       ('Дніпровський', 1),
       ('Печерський', 1),
       ('Голосіївський', 1),
       ('Дарницький', 1),
       ('Солом’янський', 1),
       ('Оболонський', 1),
       ('Шевченківський', 1),
       ('Подільський', 1),
       ('Холодногірський', 2),
       ('Шевченківський', 2),
       ('Київський', 2),
       ('Московський', 2),
       ('Немишлянський', 2),
       ('Індустріальний', 2),
       ('Слобідський', 2),
       ('Основ’янський', 2),
       ('Новобаварський', 2),
       ('Амур-Нижньодніпровський', 3),
       ('Шевченківський', 3),
       ('Соборний', 3),
       ('Індустріальний', 3),
       ('Центральний', 3),
       ('Чечелівський', 3),
       ('Новокодацький', 3),
       ('Самарський', 3),
       ('Київський', 4),
       ('Малиновський', 4),
       ('Приморський', 4),
       ('Суворовський', 4),
       ('Олександрівський', 5),
       ('Заводський', 5),
       ('Комунарський', 5),
       ('Дніпровський', 5),
       ('Вознесенівський', 5),
       ('Хортицький', 5),
       ('Шевченківський', 5);

insert into stations(name, city_id)
values ('Академмістечко', 1),
       ('Арсенальна', 1),
       ('Берестейська', 1),
       ('Бориспільська', 1),
       ('Васильківська', 1),
       ('Вокзальна', 1),
       ('Видубичі', 1),
       ('Вирлиця', 3),
       ('Виставковий центр', 1),
       ('Героїв Дніпра', 1),
       ('Голосіївська', 1),
       ('Дарниця', 1),
       ('23 Серпня', 2),
       ('Академіка Барабашова', 2),
       ('Архітектора Бекетова', 2),
       ('Історичний музей', 2);






insert into contact_type(name, url_logo)
values ('Телефон', '/static/images/contacts/phone.svg'),
       ('Facebook', '/static/images/contacts/facebook.svg'),
       ('WhatsApp', '/static/images/contacts/whats-app.svg'),
       ('Пошта', '/static/images/contacts/mail.svg'),
       ('Skype', '/static/images/contacts/skype.svg');








insert into question(title, text)
VALUES ('Як діяти, якщо вам відмовляють в інформації чи послугах українською мовою',
        '- Спочатку варто спробувати владнати ситуацію на місці та попросити працівника обслуговувати вас державною мовою. - У разі відмови працівника, звернутись до керівництва закладу або на “гарячу лінію” установи. - У разі відмови або не забезпечення надання інформації (послуг) державною мовою необхідно зафіксувати факт відмови (за допомогою аудіо-, відео, письмового підтвердження очевидців тощо) та дані суб’єкта господарювання (назву, місцезнаходження, контакти суб’єкта).'),
       ('Куди можна подавати скаргу', 'Ви можете подати скаргу до Уповноваженого із захисту державної мови на поштову адресу 01001, м. Київ, провулок Музейний, 12, електронну скриньку skarha@mova-ombudsman.gov.ua або заповнити відповідну форму на сайті Уповноваженого https://mova-ombudsman.gov.ua/'),
       ('Що має містити скарга', 'У скарзі обов’язково має бути зазначено: прізвище, ім’я, по батькові, місце проживання особи, викладено суть скарги, який саме суб’єкт/працівник суб’єкта, коли, за якою адресою, яким чином порушив право скаржника. Рекомендуємо також додати докази на підтвердження.');

